#### BuiltInFailures.InaccurateFailures Members

---

|  |
| --- |
| BuiltInFailures InaccurateFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures InaccurateFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | InaccurateAreaLine | Area separation line is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateBeamOrBrace | Beam or Brace is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateCurveBasedFamily | Curve-Based Family is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateDriveCurve | Element is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateGrid | Grid is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateLevel | Level is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateLine | Line is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateMassingSketchLine | Line in Massing Sketch is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateRefPlane | Ref Plane is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateRoomSeparation | Room separation line is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateSketchLine | Line in Sketch is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateSpaceSeparation | Space separation line is slightly off axis and may cause inaccuracies. |
| Public property Static member | InaccurateWall | Wall is slightly off axis and may cause inaccuracies. |

# See Also

BuiltInFailures InaccurateFailures Class

Autodesk.Revit.DB Namespace